{
  "id": "oni-eddie-assassin",
  "name": "Oni Eddie",
  "class": "Assassin",
  "stars": 5,
  "eddie": true,
  "awakenable": true,
  "talismans": "MMM...",
  "talismansSet": "6m 5m 4m",
  "url": "http://www.news.maiden-lotb.com/n3/character-en/oni-eddie-assassin/",
  "image": "http://www.news.maiden-lotb.com/n3/wp-content/uploads/2020/06/hud_icon_eddie_oni.png",
  "skills": [
    {
      "name": "UNDYING GRUDGE",
      "typeName": "Past Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal magic damage to a single target.",
        "• Remove all Invincibility, Immunity, Vanish and Heal Shield effects, including Golden effects, from the target before dealing damage.",
        "• 75% Chance to gain an Extra Turn if an effect was removed this way.",
        "• 50% Chance to Reduce Max HP on the target by 15%.",
        "• Inflict Exhaust, Smite and Passive Disable on the target for 2 turns if they have Reduced Max HP.",
        "• Enemies killed by this attack cannot be revived if your sword is Empowered."
      ]
    },
    {
      "name": "SHADOW STEP\n",
      "typeName": "Past Power Attack",
      "type": "Power",
      "desc": [
        "• Deal 2 hits of magic damage to a single target.",
        "• Each ally gains Vanish and 2 stacks of HP Regen for 2 turns after every action they take, including this one, until they die.",
        "• 50% Chance to inflict Dark Ghost on all enemies for 2 turns.",
        "• Inflict Dark Ghost on all enemies for 1 turn if the target has Reduced Max HP.",
        "• Enemies killed by this attack cannot be revived if your sword is Empowered."
      ],
      "powerCost": 6
    },
    {
      "name": "DEMON GATE FLAY\n",
      "typeName": "Present Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal magic damage to a single target.",
        "• Remove All Beneficial Effects, including Golden effects, from the target before dealing damage.",
        "• 50% Chance to Reduce Max HP on the target by 15%.",
        "• Remove All Golden Effects from all enemies if the target has Reduced Max HP.",
        "• Enemies killed by this attack cannot be revived if your sword is Empowered."
      ]
    },
    {
      "name": "SPIRIT OF RAJŌMON\n",
      "typeName": "Present Power Attack",
      "type": "Power",
      "desc": [
        "• Deal 2 hits of magic damage to a single target.",
        "• Grant Invincibility to self and a random ally for 2 turns.",
        "• 50% Chance to Reduce Max HP on each enemy by 25%.",
        "• Remove Immunity and Perfect Immunity from all enemies and inflict Perfect Stun on them for 1 turn if the target has Reduced Max HP.",
        "• Enemies killed by this attack cannot be revived if your sword is Empowered."
      ],
      "powerCost": 6
    },
    {
      "name": "IAIJUTSU SLASH\n",
      "typeName": "Future Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal magic damage to a single target.",
        "• Inflict Perfect Blind, Seal, Silence and Bleed on the target for 1 turn.",
        "• 50% Chance to Reduce Max HP on the target by 15%.",
        "• Deal Additional Magic Damage that can Critically Strike and inflict Perfect Blind, Seal, Silence and Bleed on the target for 3 turns if they have Reduced Max HP.",
        "• Enemies killed by this attack cannot be revived if your sword is Empowered."
      ]
    },
    {
      "name": "THREE EYED OGRE\n",
      "typeName": "Future Power Attack",
      "type": "Power",
      "desc": [
        "• Grant Golden Hit, Increased Fury Generation and Perfect Titan Shield to all allies for 2 turns.",
        "• Instantly gain an Extra Turn.",
        "• 25% Chance to grant each ally an Extra Turn.",
        "• 75% Chance to grant each ally an Extra Turn if any enemy has Reduced Max HP."
      ],
      "powerCost": 6
    },
    {
      "name": "MARCH OF A HUNDRED DEMONS\n",
      "typeName": "Fury",
      "type": "Fury",
      "desc": [
        "• Deal 3 hits of magic damage to all enemies.",
        "• Remove All Negative Effects, including Silver effects, from all allies and grant them Ascension and Magic Penetration for 3 turns.",
        "• Deal Additional Magic Damage to each enemy that has 4 or more beneficial effects.",
        "• Your Sword becomes Empowered. While Empowered, Remove All Negative Effects, including Silver effects, from all allies, Revive all allies with full HP and grant Ascension and Magic Penetration to all allies for 2 turns after every action."
      ]
    }
  ]
}