{
  "id": "vesper-woman-in-uniform-assassin",
  "name": "Vesper, Woman In Uniform",
  "class": "Assassin",
  "stars": 5,
  "eddie": false,
  "awakenable": false,
  "talismans": "WWW...",
  "talismansSet": "6w 5w 4w",
  "url": "http://www.news.maiden-lotb.com/n3/character-en/vesper-woman-in-uniform-assassin/",
  "image": "http://www.news.maiden-lotb.com/n3/wp-content/uploads/2020/06/hud_icon_womaninuniform_assassin.png",
  "skills": [
    {
      "name": "ROULETTE ROUNDS",
      "typeName": "Present Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal 2 hits of physical and true damage to a single target that increases based on your ATK and MISSING HP.",
        "• Remove All Increased Stat and Critical Strike Chance effects, including Golden and Innate effects, from the target. This effect cannot remove default Stat Increase effects from Bespoke Cosmic Talismans and does not apply to bosses.",
        "• Grant HP Regen to all allies for 2 turns and inflict Unblockable Stun on the target for 1 turn if Time Bomb effects are active on self.",
        "• Gain a 4 Hit Innate Force Shield for 2 turns if Time Bomb effects are not active on self.",
        "• Inflict Time Bomb on self or the target for 3 turns per hit."
      ]
    },
    {
      "name": "HOUSE ARREST\n",
      "typeName": "Present Power Attack",
      "type": "Power",
      "desc": [
        "• Deal 2 hits of physical and true damage to all enemies based on your ATK and MISSING HP.",
        "• Remove All Beneficial Effects, including Golden effects, from all enemies and Transfer All Negative Effects, including Silver effects, from self to each enemy before dealing damage. Heal each ally for 25% of their MAX HP if a negative effect was removed this way.",
        "• Inflict Exhaust on all enemies for 1 turn.",
        "• Extend Negative Effect Duration on all enemies by 1."
      ],
      "powerCost": 6
    },
    {
      "name": "SWEET SURRENDER\n",
      "typeName": "Passive",
      "type": "Passive",
      "desc": [
        "Immune to all Negative Effects, except Time Bomb, Perfect Time Bomb, Taunt, Silence, Perfect Silence and Seal. Reduce all damage taken by 75% for 1 turn if Time Bomb effects are not active on self at the start of battle and at the start of your turn. Your first action each turn gains Innate 100% Armor Penetration and 100% Increased Damage if Time Bomb effects are active on self at the start of battle and at the start of your turn. Extend Negative Effect Duration on self and all enemies by 1 if Time Bomb effects are active on self after every action. This skill can only be countered by Passive Disable applied at the start of battle."
      ]
    }
  ]
}