{
  "name": "Czar Eddie",
  "url": "http://www.news.maiden-lotb.com/n3/character-en/czar-eddie-magus/",
  "awakenable": false,
  "class": "Magus",
  "skills": [
    {
      "name": "CONQUEST",
      "typeName": "Past Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal magic damage to a single target that increases based on their MR stat.",
        "• Remove All Beneficial Effects from the target.",
        "• Grant Perfect Immunity to all allies for 2 turns."
      ]
    },
    {
      "name": "WISE COUNCIL\n",
      "typeName": "Past Power Attack",
      "type": "Power",
      "desc": [
        "• Heal all allies based on 25% of your MAX HP.",
        "• Copy All Beneficial Effects from all allies to self."
      ],
      "powerCost": 5
    },
    {
      "name": "SOVEREIGN\n",
      "typeName": "Present Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal magic damage to each enemy that increases based on their MR stat.",
        "• 35% Chance to Extend the Duration of Beneficial Effects on all allies by 1."
      ]
    },
    {
      "name": "KNIGHT'S HONOR\n",
      "typeName": "Present Power Attack",
      "type": "Power",
      "desc": [
        "• Grant Sacrifice, Golden Hit, Perfect Revenge and Class Advantage to all allies for 3 turns.",
        "• Remove All Beneficial Effects, including Golden effects, and inflict 4 Marks on all enemies for 1 turn.",
        "• Instantly gain an Extra Turn."
      ],
      "powerCost": 6
    },
    {
      "name": "ROYAL DECREE\n",
      "typeName": "Future Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal magic damage to each enemy that increases based on their MR stat.",
        "• 35% Chance to grant True Shield to all allies 2 turns.",
        "• 35% Chance to grant Damage Reduction Shield to all allies for 2 turns."
      ]
    },
    {
      "name": "FORTIFY\n",
      "typeName": "Future Power Attack",
      "type": "Power",
      "desc": [
        "• Grant Power Shield, Trap, Golden Trap and a 5 Hit Innate Force Shield to all allies for 2 turns.",
        "• 50% Chance to gain an Extra Turn."
      ],
      "powerCost": 5
    },
    {
      "name": "A CZAR'S LIFE\n",
      "typeName": "Passive",
      "type": "Passive",
      "desc": [
        "Reduce all damage by 60%. Remove All Negative Effects, including Silver effects, from each ally and Heal them for 15% of their Max HP for each effect removed at the start of your turn. Grant all allies Immunity to Passive Disable effects until they die and a Random Offensive and Defensive Effect, including Golden effects, for 2 turns at the start of your turn. Grant 3 Random Beneficial and Golden Effects to each ally for 1 turn after every action. Deal Additional True Damage to a random enemy based on their MR stat if Sacrifice or Power Shield are active on self after every action. 50% Chance to inflict Fear and Perfect Death on all enemies for 1 turn when you take damage. Grant Endure and Echo to all allies for 3 turns when you reach 1 HP."
      ]
    }
  ]
}