{
  "id": "genghis-khan-warrior",
  "name": "Genghis Khan",
  "class": "Warrior",
  "stars": 5,
  "eddie": false,
  "awakenable": false,
  "talismans": "GGW...",
  "talismansSet": "4w5g",
  "url": "http://www.news.maiden-lotb.com/n3/character-en/genghis-khan-warrior/",
  "image": "http://www.news.maiden-lotb.com/n3/wp-content/uploads/2020/08/hud_icon_genghiskhan.png",
  "skills": [
    {
      "name": "OCEAN OF BLOOD",
      "typeName": "Present Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal physical damage to a single target.",
        "• Remove all Golden effects, before dealing damage.",
        "• Inflict Bloodlust, HP Drain and Perfect Crave for 2 turns.",
        "• Permanently reduce MAX HP by -70%."
      ]
    },
    {
      "name": "THOUSAND STEEDS\n",
      "typeName": "Present Power Attack",
      "type": "Power",
      "desc": [
        "• Deal 3 hits of physical damage to all enemies that increases based on your CURRENT HP.",
        "• Deal additional physical damage to each enemy based on your CURRENT HP if they suffer from MAX HP reduction effects.",
        "• Inflict Perfect Death and Perfect Heal Block on each enemy if they suffer from MAX HP reduction effects.",
        "• 75% Chance to inflict Stun on each enemy for 3 turns.",
        "• Grant Armor Penetration and Attack Up to all allies for 2 turns."
      ],
      "powerCost": 5
    },
    {
      "name": "THE FIERCE KING\n",
      "typeName": "Passive",
      "type": "Passive",
      "desc": [
        "50% Chance to take no damage, remove all Immunity and Vanish effects including Golden effects, and inflict Mark and Perfect Bleed on attacking enemies for 2 turns whenever you are attacked. When you take damage, 25% Chance to inflict Stun for 2 turns on attacking enemies. Heal each ally based on your ATK if any enemy has a Mark at the start of your turn. Gain Damage Charge at the beginning of battle and at the start of your turn. If Borte, Mongol Empress or Khan Eddie is in your team, gain Ascension for 2 turns at the start of battle."
      ]
    }
  ]
}