{
  "name": "Guy Fawkes Eddie",
  "url": "http://www.news.maiden-lotb.com/n3/character-en/guy-fawkes-eddie-sentinel/",
  "awakenable": true,
  "class": "Sentinel",
  "stars": 4,
  "skills": [
    {
      "name": "DANGEROUS REMEDY",
      "typeName": "Past Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal 4 hits of physical damage to all enemies that increases based on your DEF and SPECIAL stats.",
        "• 25% Chance to inflict a Time Bomb on all enemies for 2 turns per hit.",
        "• 25% Chance to inflict Furious Burns on all enemies for 2 turns per hit.",
        "• This attack does not wake sleeping enemies."
      ]
    },
    {
      "name": "GUNPOWDER, TREASON, PLOT\n",
      "typeName": "Past Power Attack",
      "type": "Power",
      "desc": [
        "• Deal 6 hits of physical damage to all enemies that increases based on your DEF and SPECIAL stats.",
        "• Remove All Beneficial Effects, including Golden Effects, from all enemies.",
        "• 35% Chance to inflict a Random Burn Effect effect on each enemy for 2 turns per hit.",
        "• This attack does not wake sleeping enemies."
      ],
      "powerCost": 6
    },
    {
      "name": "THE SPARK\n",
      "typeName": "Present Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal physical damage to all enemies that increases based on your DEF and SPECIAL stats.",
        "• Inflict 2 Blinding Burns on each enemy for 2 turns if they are suffering from Burn effects.",
        "• 80% Chance to inflict 2 Physical Burns on all enemies for 2 turns.",
        "• This attack does not wake sleeping enemies."
      ]
    },
    {
      "name": "DIVINE PROVIDENCE\n",
      "typeName": "Present Power Attack",
      "type": "Power",
      "desc": [
        "• Heal all allies based on on your DEF and SPECIAL stats.",
        "• Grant Perfect Immunity and Endure to all allies for 2 turns.",
        "• Remove Immunity and Perfect Immunity from all enemies.",
        "• Inflict 2 Magic Burns on all enemies for 2 turns.",
        "• Instantly gain an Extra Turn."
      ],
      "powerCost": 6
    },
    {
      "name": "OMEN OF EFFIGIES\n",
      "typeName": "Future Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal 4 hits of physical damage to all enemies that increases based on your DEF and SPECIAL stats.",
        "• Grant Magma Shield to all allies for 1 turn.",
        "• 50% Chance to inflict Sleep on all enemies for 2 turns.",
        "• This attack does not wake sleeping enemies."
      ]
    },
    {
      "name": "IMMORTAL IDEA\n",
      "typeName": "Future Power Attack",
      "type": "Power",
      "desc": [
        "• Revive all allies with 60% HP.",
        "• Grant Charge, Perfect Immortality, Increased Fury Generation and Increased Power Generation to all allies for 2 turns.",
        "• Instantly grant an Extra Turn to all allies."
      ],
      "powerCost": 6
    },
    {
      "name": "REMEMBER, REMEMBER\n",
      "typeName": "Passive",
      "type": "Passive",
      "desc": [
        "Grant Magma Shield to all allies for 1 turn at the start of battle. Transform all Burn effects on each enemy into up to 3 Perfect Time Bombs for 3 turns at the start of battle and at the start of your turn. Trigger all Time Bomb effects on each sleeping enemy after every action. Once per battle, Revive with full HP and grant all allies Ascension for 3 turns upon death."
      ]
    }
  ],
  "eddie": true,
  "image": "http://www.news.maiden-lotb.com/n3/wp-content/uploads/2020/06/hud_icon_eddie_fawkes.png",
  "id": "guy-fawkes-eddie-sentinel"
}