{
  "id": "iron-maiden-eddie-gunner",
  "name": "Iron Maiden Eddie",
  "class": "Gunner",
  "stars": 5,
  "eddie": true,
  "awakenable": false,
  "talismans": "GGG...",
  "url": "http://www.news.maiden-lotb.com/n3/character-en/iron-maiden-eddie-gunner/",
  "image": "http://www.news.maiden-lotb.com/n3/wp-content/uploads/2020/06/hud_icon_eddie_ironmaiden.png",
  "skills": [
    {
      "name": "BLOODSHED",
      "typeName": "Past Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deals random damage to all enemies.",
        "• 35% to inflict Bloodlust on the target for 2 turns.",
        "• 35% Chance to inflict Heal Block on the target for 2 turns.",
        "• Remove Immunity and Damage Block effects on the target and inflict Blind for 1 turn before dealing damage if negative effects are present on self."
      ]
    },
    {
      "name": "PLASMA WINE\n",
      "typeName": "Past Power Attack",
      "type": "Power",
      "desc": [
        "• Inflict HP Drain on all enemies for the duration of battle.",
        "• Instantly gain an Extra Turn.",
        "• Remove Immunity and Damage Block effects on the target and grant Thorn Shield to all allies for 2 turns before dealing damage if negative effects are present on self."
      ],
      "powerCost": 5
    },
    {
      "name": "PROWLER\n",
      "typeName": "Present Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deals random damage to a single target.",
        "• 35% to inflict Silence on the target for 2 turns.",
        "• 35% Chance to inflict Passive Disable on the target for 2 turns.",
        "• Remove Immunity and Damage Block effects on the target and inflict Perfect Death for 1 turn before dealing damage if negative effects are present on self."
      ]
    },
    {
      "name": "INSANITY\n",
      "typeName": "Present Power Attack",
      "type": "Power",
      "desc": [
        "• Deals random damage to all enemies.",
        "• Inflict a Random Negative Effect for each beneficial effect on each enemy.",
        "• Remove Immunity and Damage Block effects on targets and inflict Curse for 2 turns before dealing damage if negative effects are present on self."
      ],
      "powerCost": 6
    },
    {
      "name": "CREEP\n",
      "typeName": "Future Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deals random damage to all enemies.",
        "• 35% to inflict Perfect Corruption on enemies for 1 turn.",
        "• Remove Immunity and Damage Block effects on the target before dealing damage and grant Perfect Accuracy Up to all allies for 1 turn if negative effects are present on self."
      ]
    },
    {
      "name": "REEL\n",
      "typeName": "Future Power Attack",
      "type": "Power",
      "desc": [
        "• Deals random damage to a single target.",
        "• 35% to inflict Crave on the target for 2 turns.",
        "• 35% Chance to inflict Punishment on the target for 2 turns.",
        "• Instantly gain an Extra Turn.",
        "• Remove Immunity and Damage Block effects on the target and inflict Crave and Punishment on all enemies before dealing damage if negative effects are present on self."
      ],
      "powerCost": 5
    },
    {
      "name": "STRANGE WORLD\n",
      "typeName": "Fury",
      "type": "Fury",
      "desc": [
        "• Deals random damage to all enemies.",
        "• Remove All Immunity, including Vanish and Perfect Immunity and Damage Block effects on targets before dealing damage.",
        "• Inflict Perfect Accuracy Down and Exhaust on all enemies for 3 turns.",
        "• Revive all allies with full Hp and grant each ally an Extra Turn and Immunity to Permadeath and Apparition effects, including innate and Silver versions, until they die if any negative effects are present on self."
      ]
    }
  ]
}