{
  "name": "Lone Star Eddie",
  "url": "http://www.news.maiden-lotb.com/n3/character-en/lone-star-eddie-gunner/",
  "awakenable": false,
  "class": "Gunner",
  "skills": [
    {
      "name": "SUPER .38",
      "typeName": "Past Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deals 6 hits of physical damage to a single target.",
        "• 50% Chance to Remove One Beneficial Effect per hit.",
        "• 35% Chance to Remove One Golden Effects per hit if Perfect Hit is active."
      ]
    },
    {
      "name": "BLARING SIRENS\n",
      "typeName": "Past Power Attack",
      "type": "Power",
      "desc": [
        "• Remove Immunity and Perfect Immunity from the target.",
        "• Inflict a Random Negative Effect for 2 turns for each beneficial effect still on the target.",
        "• Wake all allies suffering from Sleep, Perfect Sleep, Stun, or Perfect Stun."
      ],
      "powerCost": 5
    },
    {
      "name": "BUCKSHOT\n",
      "typeName": "Present Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deals 2 hits of physical damage to a single target.",
        "• Inflict Seal for 2 turns.",
        "• 50% Chance to Stun the target for 2 turns on each hit."
      ]
    },
    {
      "name": "HOGTIE\n",
      "typeName": "Present Power Attack",
      "type": "Power",
      "desc": [
        "• Deals 3 hits of physical damage to a single target.",
        "• 25% Chance to Critically Strike on each hit.",
        "• Inflict Punishment for 3 turns.",
        "• Increase Negative Effect Duration on the target by 2 turns.",
        "• Gain Critically Strike Chance for 2 turns if the enemy’s HP is 50% or higher."
      ],
      "powerCost": 6
    },
    {
      "name": "SLAM FIRE\n",
      "typeName": "Future Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deals 4 hits of physical damage to a single target.",
        "• Inflict Perfect Bleed for 3 turns.",
        "• Remove Immortality and Perfect Immortality from the target."
      ]
    },
    {
      "name": "BLOCKADE\n",
      "typeName": "Future Power Attack",
      "type": "Power",
      "desc": [
        "• Heal all allies based on your ATK stat.",
        "• Grant Physical, Magic, or True Damage Invulnerability to each ally for 2 turns.",
        "• Grant Revenge to all allies for 2 turns.",
        "• Grant an Extra Turn to self and a random ally."
      ],
      "powerCost": 5
    },
    {
      "name": "SHOW OF FORCE\n",
      "typeName": "Passive",
      "type": "Passive",
      "desc": [
        "Apply Perfect Accuracy to self and allies for the Duration of battle. 35% Chance to Remove Invincibility from all enemies at the beginning of your turn. Inflict a random negative effect on a random enemy for 2 turns and reduce their Max HP by 10% at the start of your turn."
      ]
    }
  ]
}