{
  "id": "the-mercenary-warrior",
  "name": "The Mercenary",
  "class": "Warrior",
  "stars": 5,
  "eddie": false,
  "awakenable": false,
  "talismans": "WWW",
  "url": "http://www.news.maiden-lotb.com/n3/character-en/the-mercenary-warrior/",
  "image": "http://www.news.maiden-lotb.com/n3/wp-content/uploads/2020/05/hud_icon_mercenary.png",
  "skills": [
    {
      "name": "IF IT BLEEDS",
      "typeName": "Present Basic Attack",
      "type": "Basic",
      "desc": [
        "• Deal physical damage to a single target.",
        "• Deal Additional Physical Damage based on the target’s MISSING HP if their HP is 50% or below.",
        "• Inflict Bleed and Perfect Bleed on the target for the duration of battle.",
        "• Remove All Beneficial Effects, including Golden effects, and inflict Bloodlust and HP Drain for 2 turns if the target is suffering from any Bleed effect."
      ]
    },
    {
      "name": "NO FEAR, NO PAIN\n",
      "typeName": "Present Power Attack",
      "type": "Power",
      "desc": [
        "• Deal physical damage to a single target.",
        "• Remove All Negative Effects, including Silver effects, and Heal self for 10% of your MAX HP for each effect removed.",
        "• Increase MAX HP and ATK by +50%, increased to 100% if activated while below 50% HP.",
        "• Gain Endure, Counterstrike and Golden Trap for 2 turns.",
        "• Instantly gain an Extra Turn."
      ],
      "powerCost": 6
    },
    {
      "name": "NOWHERE TO HIDE\n",
      "typeName": "Passive",
      "type": "Passive",
      "desc": [
        "Immune to all Silence and Skill Disabling effects. Grant all allies Perfect Vanish and Golden Trap for 2 turns at the start of battle. Gain 100% Critical Strike Chance for 1 turn if Vanish effects are active on self at the start of your turn. Place a Mark of Diablo on a random enemy at the start of your turn that prevents the target from reviving, gaining beneficial effects, and causes them to take additional random damage equal to 10% of their MAX HP when they take damage. This effect does not apply to bosses. Gain Perfect Vanish for 2 turns after every action. Attacks always land as Perfect Hits."
      ]
    }
  ]
}